{
  "entities": [
    {
      "entity_id": "E1",
      "canonical_name": "Valeriy Shaytanov",
      "entity_type": "person",
      "aliases": [
        "Lt. General Valeriy Shaytanov",
        "Shaytanov"
      ],
      "mentions": [
        {
          "snippet": "On 14 April 2020, Ukraine's security service (SBU) announced the arrest of Lt. General Valeriy Shaytanov, deputy chief of the SBU's own anti-terrorist division who had played a prominent role in negotiating ceasefires and prisoner exchanges with Russia-backed militants in Eastern Ukraine.",
          "context": "Named as an SBU deputy chief arrested in April 2020 and alleged to have been recruited by an FSB operative."
        }
      ]
    },
    {
      "entity_id": "E2",
      "canonical_name": "Igor Anatolyevich Egorov",
      "entity_type": "person",
      "aliases": [
        "Col. Igor Egorov",
        "Colonel Igor Egorov",
        "Igor Egorov",
        "Col. Egorov",
        "Egorov",
        "Elbrus (alleged alias)"
      ],
      "mentions": [
        {
          "snippet": "The SBU alleged the general had been recruited before the start of the 2014 war by an FSB operative, Colonel Igor Egorov, during one of the Russian's many visits to Ukraine as part of a joint Russian-Ukrainian anti-terrorism working group.",
          "context": "Identified as an FSB colonel accused of recruiting an SBU official; central subject of the investigation and candidate for the nom-de-guerre 'Elbrus'."
        },
        {
          "snippet": "In early 2019, we hypothesized that Col. Egorov may in fact be the elusive FSB kurator 'Elbrus'.",
          "context": "Investigation's core hypothesis linking Egorov to the alias 'Elbrus' and to activities in Donbass and Crimea."
        },
        {
          "snippet": "Col. Igor Egorov serves as deputy chairman of the Vympel Veteran Association.",
          "context": "Describes Egorov's institutional ties to the Vympel veterans' group, suggesting deep links to the elite unit."
        }
      ]
    },
    {
      "entity_id": "E3",
      "canonical_name": "Adam Osmayev",
      "entity_type": "person",
      "aliases": [
        "Adam Osmaev",
        "Osmaev",
        "Osmaev (alternate spelling)"
      ],
      "mentions": [
        {
          "snippet": "FSB's Col. Egorov had tasked the would-be assassin with the murder of Adam Osmayev, a Russian national and ethnic Chechen who lives in exile in Ukraine and used to lead a battalion of Chechens fighting alongside Ukrainian forces.",
          "context": "Named as a targeted Chechen exile and former commander of a Chechen unit fighting in Ukraine; alleged target of an FSB assassination plot."
        },
        {
          "snippet": "Adam Osmaev was initially charged with plotting to assassinate Chechnya's ruler Ramzan Kadyrov in 2007, and later Vladimir Putin in 2012 (he denies both charges...).",
          "context": "Gives background on charges Russia leveled against him and his militant history."
        }
      ]
    },
    {
      "entity_id": "E4",
      "canonical_name": "Boris Rozhin",
      "entity_type": "person",
      "aliases": [
        "Colonel Cassad",
        "Rozhin"
      ],
      "mentions": [
        {
          "snippet": "The earliest public reference to 'Elbrus' came from the separatist blogger and war correspondent Boris Rozhin ('Colonel Cassad'), who in November 2014 first wrote about the failed attempt by two Moscow-installed military commanders – 'Delfin' and 'Elbrus'.",
          "context": "Cited as the first public source to mention 'Elbrus' and 'Delfin' in November 2014."
        }
      ]
    },
    {
      "entity_id": "E5",
      "canonical_name": "Oleg Ivannikov",
      "entity_type": "person",
      "aliases": [
        "Andrey Ivanovich",
        "Andrey Ivanovich Laptev",
        "Orion",
        "Col. Ivannikov",
        "Ivannikov"
      ],
      "mentions": [
        {
          "snippet": "This operative was Oleg Ivannikov, a colonel from Russian military intelligence (GRU) who had previously served – under the cover name of Andrey Ivanovich Laptev – a two-year stint as the Defense Minister of the Russia-backed breakaway territory of South Ossetia.",
          "context": "Identified as a GRU colonel who operated under cover names and used the call sign 'Orion', presented as a GRU counterpart to the FSB 'Elbrus'."
        },
        {
          "snippet": "In May 2018, Bellingcat identified and publicly disclosed the identity of one of the key Russian military supervisors ... who had operated under the cover name 'Andrey Ivanovich' and the call sign 'Orion'.",
          "context": "Links Ivannikov to previous Bellingcat reporting exposing GRU activity in Donbass."
        }
      ]
    },
    {
      "entity_id": "E6",
      "canonical_name": "Ramzan Kadyrov",
      "entity_type": "person",
      "aliases": [
        "Kadyrov"
      ],
      "mentions": [
        {
          "snippet": "Adam Osmaev was initially charged with plotting to assassinate Chechnya's ruler Ramzan Kadyrov in 2007...",
          "context": "Referenced as the alleged target of an assassination plot Osmaev was accused of planning."
        }
      ]
    },
    {
      "entity_id": "E7",
      "canonical_name": "Vladimir Putin",
      "entity_type": "person",
      "aliases": [
        "Putin"
      ],
      "mentions": [
        {
          "snippet": "Adam Osmaev was initially charged with plotting to assassinate ... and later Vladimir Putin in 2012 (he denies both charges...).",
          "context": "Mentioned as another high-profile figure Osmaev was accused of plotting against."
        }
      ]
    },
    {
      "entity_id": "E8",
      "canonical_name": "Nadiya Savchenko",
      "entity_type": "person",
      "aliases": [
        "Nadia Savchenko",
        "Savchenko"
      ],
      "mentions": [
        {
          "snippet": "A March 2016 Meduza investigation into the kidnapping of the Ukrainian soldier Nadia Savchenko quotes the LNR unit commander who says he personally detained Savchenko before the artillery shelling took place.",
          "context": "Referenced in relation to an LNR commander handing over her belongings to 'Elbrus' and to events during her detention/kidnapping."
        }
      ]
    },
    {
      "entity_id": "E9",
      "canonical_name": "Amina Okueva",
      "entity_type": "person",
      "aliases": [
        "Amina Okueva (Chechen-Ukrainian)"
      ],
      "mentions": [
        {
          "snippet": "Osmaev was the target of two assassination attempts in Kyiv in 2017 – the second of which killed his wife and comrade-in-arms, the Chechen-Ukrainian Amina Okueva.",
          "context": "Named as Osmaev's wife and fellow fighter who was killed in an assassination attempt in Kyiv."
        }
      ]
    },
    {
      "entity_id": "E10",
      "canonical_name": "Vadim Krasikov",
      "entity_type": "person",
      "aliases": [
        "Krasikov"
      ],
      "mentions": [
        {
          "snippet": "Remarkably or coincidentally, Col. Egorov flew to Croatia just after Vadim Krasikov flew to Paris on route to his operation in Berlin.",
          "context": "Referenced in temporal proximity to Egorov's travel and the Berlin assassination, implying potential linkage to the Berlin operation."
        }
      ]
    },
    {
      "entity_id": "E11",
      "canonical_name": "Zelimkhan Khangoshvili",
      "entity_type": "person",
      "aliases": [
        "Khangoshvili",
        "Zelimkhan Khangoshvili (Khangoshvili)"
      ],
      "mentions": [
        {
          "snippet": "In our previous investigations, we determined that the FSB used current and former members of its Vympel/Department V Spetsnaz units to carry out the extraterritorial assassination of Zelimkhan Khangoshvili in Berlin.",
          "context": "Named as a Chechen targeted and assassinated in Berlin—used as a prior example of FSB extraterritorial killings."
        },
        {
          "snippet": "Egorov returned to Moscow on 23 August 2019, immediately after Khangoshvili's assassination.",
          "context": "Temporal link between Egorov's travel and the Berlin assassination of Khangoshvili."
        }
      ]
    },
    {
      "entity_id": "E12",
      "canonical_name": "King Abdullah II of Jordan",
      "entity_type": "person",
      "aliases": [
        "King Abdullah II",
        "Abdullah II"
      ],
      "mentions": [
        {
          "snippet": "A trip to Jordan's capital Amman took place 3 weeks after Jordan's King Abdullah II visited the Kremlin to discuss, among others, Russian-Jordanian military cooperation and Syria-related security issues.",
          "context": "Referenced to provide timing/context for Egorov's travel to Amman and diplomatic ties between Jordan and Russia."
        }
      ]
    },
    {
      "entity_id": "E13",
      "canonical_name": "Delfin (nom-de-guerre)",
      "entity_type": "person",
      "aliases": [
        "Delfin"
      ],
      "mentions": [
        {
          "snippet": "The earliest public reference to 'Elbrus' came from ... Boris Rozhin ... who in November 2014 first wrote about the failed attempt by two Moscow-installed military commanders – 'Delfin' and 'Elbrus' – to consolidate ...",
          "context": "Named as one of two nom-de-guerre commanders involved in attempts to consolidate pro-Russian armed groups in Luhansk."
        }
      ]
    },
    {
      "entity_id": "E14",
      "canonical_name": "Bellingcat Investigation Team",
      "entity_type": "organization",
      "aliases": [
        "Bellingcat",
        "Bellingcat Investigation Team",
        "Bellingcat Investigation"
      ],
      "mentions": [
        {
          "snippet": "Bellingcat and The Insider had previously identified – but had not yet publicly disclosed – Col. Igor Anatolyevich Egorov as a senior officer ...",
          "context": "Publisher/authors of the investigation; conducted previous reporting linking Egorov to FSB activities."
        }
      ]
    },
    {
      "entity_id": "E15",
      "canonical_name": "The Insider",
      "entity_type": "organization",
      "aliases": [
        "The Insider (news outlet)"
      ],
      "mentions": [
        {
          "snippet": "Bellingcat and The Insider had previously identified – but had not yet publicly disclosed – Col. Igor Anatolyevich Egorov as a senior officer ...",
          "context": "Named as a media partner that had been involved in prior identification efforts."
        }
      ]
    },
    {
      "entity_id": "E16",
      "canonical_name": "Security Service of Ukraine (SBU)",
      "entity_type": "organization",
      "aliases": [
        "SBU",
        "Ukraine's security service"
      ],
      "mentions": [
        {
          "snippet": "On 14 April 2020, Ukraine's security service (SBU) announced the arrest of Lt. General Valeriy Shaytanov ...",
          "context": "Identified as the Ukrainian agency that published the arrest, audio recordings, and video alleging Egorov's activities."
        },
        {
          "snippet": "The SBU also published footage from apparent video surveillance of the latest meet-up between Col. Egorov and the would-be contract killer, which the SBU says took place in Hamburg, Germany, in February of this year.",
          "context": "SBU conducted and released sting materials and geolocation evidence."
        }
      ]
    },
    {
      "entity_id": "E17",
      "canonical_name": "Federal Security Service of the Russian Federation (FSB)",
      "entity_type": "organization",
      "aliases": [
        "FSB",
        "Russian FSB",
        "Federal Security Service",
        "the FSB"
      ],
      "mentions": [
        {
          "snippet": "The SBU alleged the general had been recruited before the start of the 2014 war by an FSB operative, Colonel Igor Egorov ...",
          "context": "Identified as the Russian security service whose operative (Egorov) is central to the allegations and extraterritorial operations."
        },
        {
          "snippet": "Bellingcat and The Insider had previously identified ... as a senior officer from FSB's elite Spetznaz force known as Department V, the successor to the KGB's elite subversion and special operations unit Vympel.",
          "context": "FSB connected to Department V and Vympel as its elite subversion force."
        }
      ]
    },
    {
      "entity_id": "E18",
      "canonical_name": "KGB",
      "entity_type": "organization",
      "aliases": [
        "KGB"
      ],
      "mentions": [
        {
          "snippet": "The SBU's press release also alleged that Col. Egorov was a highly decorated KGB, and later FSB, officer who had received a medal for his role in annexing Crimea in 2014.",
          "context": "Referenced as Egorov's earlier service and to explain Vympel's lineage from KGB units."
        }
      ]
    },
    {
      "entity_id": "E19",
      "canonical_name": "Vympel",
      "entity_type": "unit",
      "aliases": [
        "Vympel Spetsnaz",
        "Vympel Spetznaz",
        "Vympel Spetsnaz unit",
        "Vympel Veteran Association (related)"
      ],
      "mentions": [
        {
          "snippet": "Col. Igor Anatolyevich Egorov as a senior officer from FSB's elite Spetznaz force known as Department V, the successor to the KGB's elite subversion and special operations unit Vympel.",
          "context": "Named as the elite KGB/FSB special operations unit linked to Egorov and 'Elbrus'."
        },
        {
          "snippet": "Col. Igor Egorov serves as deputy chairman of the Vympel Veteran Association.",
          "context": "Shows Egorov's institutional veteran ties to Vympel."
        }
      ]
    },
    {
      "entity_id": "E20",
      "canonical_name": "Department V (FSB)",
      "entity_type": "unit",
      "aliases": [
        "Department V",
        "Department-V",
        "FSB Department V",
        "Vympel / Department-V"
      ],
      "mentions": [
        {
          "snippet": "Bellingcat and The Insider had previously identified ... as a senior officer from FSB's elite Spetznaz force known as Department V, the successor to the KGB's elite subversion and special operations unit Vympel.",
          "context": "Identifies Department V as the FSB structure succeeding Vympel and as Egorov's unit."
        }
      ]
    },
    {
      "entity_id": "E21",
      "canonical_name": "GRU (Main Directorate of the General Staff of the Armed Forces of the Russian Federation)",
      "entity_type": "organization",
      "aliases": [
        "GRU",
        "Russian military intelligence",
        "Main Intelligence Directorate",
        "military intelligence (GRU)"
      ],
      "mentions": [
        {
          "snippet": "In our previous investigations into the role of GRU undercover officers in supervising and aiding Russian and Russia-backed militants in Eastern Ukraine ...",
          "context": "Referenced as Russian military intelligence whose operatives (like Ivannikov) have been active in Donbass and in competition with FSB."
        }
      ]
    },
    {
      "entity_id": "E22",
      "canonical_name": "Joint Investigation Team (JIT)",
      "entity_type": "organization",
      "aliases": [
        "JIT",
        "Joint Investigation Team into MH17"
      ],
      "mentions": [
        {
          "snippet": "Telephone intercepts recently published by the Joint Investigation Team (JIT) into the downing of MH17 provide evidence of this competition escalating into hot turf-wars ...",
          "context": "Named as the investigative body that published intercepts related to MH17 and the activities of 'Elbrus'."
        }
      ]
    },
    {
      "entity_id": "E23",
      "canonical_name": "Vympel Veteran Association",
      "entity_type": "organization",
      "aliases": [
        "Vympel Veteran Association"
      ],
      "mentions": [
        {
          "snippet": "Col. Igor Egorov serves as deputy chairman of the Vympel Veteran Association.",
          "context": "An organizational tie used to support Egorov's long-term link to Vympel."
        }
      ]
    },
    {
      "entity_id": "E24",
      "canonical_name": "Novaya Gazeta",
      "entity_type": "organization",
      "aliases": [
        "Novaya Gazeta"
      ],
      "mentions": [
        {
          "snippet": "A Novaya Gazeta investigation from February 2016 quotes local sources as describing 'Elbrus' as a senior, retired FSB officer who was based in Luhansk in 2014.",
          "context": "Cited as a media source that reported on 'Elbrus' being an FSB officer based in Luhansk."
        }
      ]
    },
    {
      "entity_id": "E25",
      "canonical_name": "Meduza",
      "entity_type": "organization",
      "aliases": [
        "Meduza"
      ],
      "mentions": [
        {
          "snippet": "A March 2016 Meduza investigation into the kidnapping of the Ukrainian soldier Nadia Savchenko quotes the LNR unit commander ... He then said he handed over her belongings to 'Elbrus, who called himself the FSB advisor to the LNR leadership'.",
          "context": "Media outlet cited for reporting that 'Elbrus' presented himself as FSB advisor to LNR leadership."
        }
      ]
    },
    {
      "entity_id": "E26",
      "canonical_name": "Der Spiegel",
      "entity_type": "organization",
      "aliases": [
        "Der Spiegel"
      ],
      "mentions": [
        {
          "snippet": "Data from a visa processing database in Russia reviewed by Der Spiegel shows that in December 2016, Egorov applied for and received a multi-entry, four-year visa issued by France ...",
          "context": "Named as an investigative partner that reviewed and reported visa documents linked to Egorov."
        }
      ]
    },
    {
      "entity_id": "E27",
      "canonical_name": "Luhansk People's Republic (LNR)",
      "entity_type": "organization",
      "aliases": [
        "LNR",
        "Luhansk People's Republic",
        "self-declared Luhansk People's Republic"
      ],
      "mentions": [
        {
          "snippet": "The earliest public reference to 'Elbrus' came from the separatist blogger ... who in November 2014 first wrote about the failed attempt by two Moscow-installed military commanders – 'Delfin' and 'Elbrus' – to consolidate the more than 20 disparate and infighting pro-Russian armed groups in the self-declared 'Luhansk People's Republic' (LNR) in eastern Ukraine.",
          "context": "Identified as the breakaway entity in eastern Ukraine where 'Elbrus' operated and tried to consolidate armed groups."
        }
      ]
    },
    {
      "entity_id": "E28",
      "canonical_name": "Donetsk People's Republic (DPR)",
      "entity_type": "organization",
      "aliases": [
        "Donetsk People's Republic",
        "Donetsk people's republic",
        "Donetsk"
      ],
      "mentions": [
        {
          "snippet": "The JIT published a number of intercepted phone calls from the days just before the downing of flight MH17, which contained conversations between militants in the self-proclaimed 'people's republics' of Donetsk and Luhansk.",
          "context": "Named as one of the self-proclaimed entities whose militants feature in intercepts mentioning 'Elbrus'."
        }
      ]
    },
    {
      "entity_id": "E29",
      "canonical_name": "South Ossetia",
      "entity_type": "location",
      "aliases": [
        "South Ossetia",
        "Russia-backed breakaway territory of South Ossetia"
      ],
      "mentions": [
        {
          "snippet": "Oleg Ivannikov ... had previously served – under the cover name of Andrey Ivanovich Laptev – a two-year stint as the Defense Minister of the Russia-backed breakaway territory of South Ossetia.",
          "context": "Referenced as the breakaway territory where Ivannikov (under cover) served in a ministerial capacity."
        }
      ]
    },
    {
      "entity_id": "E30",
      "canonical_name": "MH17 downing",
      "entity_type": "event",
      "aliases": [
        "MH17",
        "downing of flight MH17",
        "the downing of MH17"
      ],
      "mentions": [
        {
          "snippet": "Telephone intercepts recently published by the Joint Investigation Team (JIT) into the downing of MH17 provide evidence of this competition escalating into hot turf-wars ...",
          "context": "Event central to the investigation; intercepts suggest 'Elbrus' was active just before MH17 was shot down."
        },
        {
          "snippet": "Given that his arrival was just prior to the tragic shoot-down of MH17 by a Russian BUK missile, such role makes Elbrus a person of interest in the MH17 investigation.",
          "context": "Links 'Elbrus' (and by hypothesis Egorov) to timing and potential command role around MH17's shoot-down."
        }
      ]
    },
    {
      "entity_id": "E31",
      "canonical_name": "Annexation of Crimea (2014)",
      "entity_type": "event",
      "aliases": [
        "annexation of Crimea",
        "Crimea annexation 2014",
        "Crimea events"
      ],
      "mentions": [
        {
          "snippet": "The SBU's press release also alleged that Col. Egorov was a highly decorated KGB, and later FSB, officer who had received a medal for his role in annexing Crimea in 2014.",
          "context": "Used to describe Egorov's purported award and involvement in Russia's 2014 seizure of Crimea."
        }
      ]
    },
    {
      "entity_id": "E32",
      "canonical_name": "Berlin assassination of Zelimkhan Khangoshvili",
      "entity_type": "event",
      "aliases": [
        "Khangoshvili assassination",
        "Khangoshvili killing in Berlin",
        "assassination of Zelimkhan Khangoshvili"
      ],
      "mentions": [
        {
          "snippet": "In our previous investigations, we determined that the FSB used current and former members of its Vympel/Department V Spetsnaz units to carry out the extraterritorial assassination of Zelimkhan Khangoshvili in Berlin.",
          "context": "Named as a prior FSB-linked extraterritorial assassination used as precedent for alleged plots."
        }
      ]
    },
    {
      "entity_id": "E33",
      "canonical_name": "Second Chechen War",
      "entity_type": "event",
      "aliases": [
        "Second Chechen War"
      ],
      "mentions": [
        {
          "snippet": "Russia has formally accused both Khangoshvili and Osmaev of being terrorists: Khangoshvili over supposed crimes during his participation in the Second Chechen War in the early 2000s...",
          "context": "Historical conflict referenced to explain alleged past activities and Russian charges against the two Chechen targets."
        }
      ]
    },
    {
      "entity_id": "E34",
      "canonical_name": "Russo-Georgian War (2008)",
      "entity_type": "event",
      "aliases": [
        "Georgian-Russian War in 2008",
        "2008 Russo-Georgian War"
      ],
      "mentions": [
        {
          "snippet": "Khangosvili had taken part in the Second Chechen war and had formed a volunteer combat unit in the Georgian-Russian War in 2008 (although this unit never saw military action);",
          "context": "Referenced as part of Khangoshvili's militant history."
        }
      ]
    },
    {
      "entity_id": "E35",
      "canonical_name": "War in Eastern Ukraine / Donbass (2014-2015)",
      "entity_type": "event",
      "aliases": [
        "War in Eastern Ukraine",
        "Donbass conflict",
        "Donbas war",
        "2014 war"
      ],
      "mentions": [
        {
          "snippet": "The SBU alleged the general had been recruited before the start of the 2014 war by an FSB operative ...",
          "context": "Referenced as the broader conflict context in which operatives like Egorov and GRU agents operated."
        },
        {
          "snippet": "... ethnic Chechens who fought in key battles against Russian forces and pro-Russian militants in Eastern Ukraine in 2014 and 2015.",
          "context": "Explains the combat background of Osmaev and other Chechen fighters involved in the conflict."
        }
      ]
    },
    {
      "entity_id": "E36",
      "canonical_name": "Gänsemarkt Passage shopping mall",
      "entity_type": "location",
      "aliases": [
        "Gänsemarkt Passage",
        "Gänsemarkt Passage shopping mall",
        "Gaensemarkt Passage"
      ],
      "mentions": [
        {
          "snippet": "The location of the video – which shows Egorov typing into his phone as he walks alongside the other man whose faced is blurred – can easily be geolocated to Hamburg's Gänsemarkt Passage shopping mall.",
          "context": "Specific geolocated site in Hamburg where SBU video surveillance allegedly captured Egorov."
        }
      ]
    },
    {
      "entity_id": "E37",
      "canonical_name": "Hamburg",
      "entity_type": "location",
      "aliases": [
        "Hamburg, Germany",
        "Hamburg"
      ],
      "mentions": [
        {
          "snippet": "The SBU says [the meet-up] took place in Hamburg, Germany, in February of this year.",
          "context": "City where Egorov allegedly met the would-be contract killer and where video footage was taken."
        }
      ]
    },
    {
      "entity_id": "E38",
      "canonical_name": "Germany",
      "entity_type": "location",
      "aliases": [
        "Germany",
        "Federal Republic of Germany"
      ],
      "mentions": [
        {
          "snippet": "It is unclear if the FSB's targeting of these two ethnic Chechens is mainly due to their earlier involvement... Khangoshvili had been shot at and targeted by bombs in Georgia and Ukraine before he was finally killed in Germany...",
          "context": "Country where Khangoshvili was assassinated and where allegations of non-arrest of Egorov arose."
        },
        {
          "snippet": "Ukrainian sources interviewed by us on condition of anonymity have claimed that Ukraine had requested Egorov's arrest during his latest visit to Hamburg but that Germany declined to detain him.",
          "context": "Referenced in relation to law enforcement response and possible coordination over arrest decisions."
        }
      ]
    },
    {
      "entity_id": "E39",
      "canonical_name": "Russia",
      "entity_type": "location",
      "aliases": [
        "Russian Federation",
        "Russia"
      ],
      "mentions": [
        {
          "snippet": "The SBU alleged the general had been recruited ... by an FSB operative, Colonel Igor Egorov, during one of the Russian's many visits to Ukraine ...",
          "context": "Country of origin for FSB, GRU and the operatives discussed, central to the geopolitical context."
        }
      ]
    },
    {
      "entity_id": "E40",
      "canonical_name": "Ukraine",
      "entity_type": "location",
      "aliases": [
        "Ukraine",
        "Kyiv (nation)"
      ],
      "mentions": [
        {
          "snippet": "On 14 April 2020, Ukraine's security service (SBU) announced the arrest of Lt. General Valeriy Shaytanov ...",
          "context": "Country where the SBU is based, location of exile for several Chechens and where many incidents occurred."
        }
      ]
    },
    {
      "entity_id": "E41",
      "canonical_name": "Donbass",
      "entity_type": "location",
      "aliases": [
        "Donbass",
        "Donbas",
        "the Donbass"
      ],
      "mentions": [
        {
          "snippet": "... between Moscow and the three control centers for Russia's military operations in the Donbass: Rostov, Simferopol, and Krasnodar.",
          "context": "Region where Russian military operations and control centers are located; area of conflict."
        }
      ]
    },
    {
      "entity_id": "E42",
      "canonical_name": "Rostov-on-Don",
      "entity_type": "location",
      "aliases": [
        "Rostov",
        "Rostov-on-Don"
      ],
      "mentions": [
        {
          "snippet": "he had traveled extensively – under two different identities – as Igor Egorov ... between Moscow and the three control centers for Russia's military operations in the Donbass: Rostov, Simferopol, and Krasnodar.",
          "context": "Named as one of the Russian control centers for military operations tied to operations in Donbass."
        }
      ]
    },
    {
      "entity_id": "E43",
      "canonical_name": "Simferopol",
      "entity_type": "location",
      "aliases": [
        "Simferopol"
      ],
      "mentions": [
        {
          "snippet": "... between Moscow and the three control centers for Russia's military operations in the Donbass: Rostov, Simferopol, and Krasnodar.",
          "context": "Listed as one of the centers used by operatives traveling for Donbass-related activities."
        }
      ]
    },
    {
      "entity_id": "E44",
      "canonical_name": "Krasnodar",
      "entity_type": "location",
      "aliases": [
        "Krasnodar"
      ],
      "mentions": [
        {
          "snippet": "... between Moscow and the three control centers for Russia's military operations in the Donbass: Rostov, Simferopol, and Krasnodar.",
          "context": "Listed as a travel/control center in the Donbass operational network."
        }
      ]
    },
    {
      "entity_id": "E45",
      "canonical_name": "Moscow",
      "entity_type": "location",
      "aliases": [
        "Moscow"
      ],
      "mentions": [
        {
          "snippet": "In 2014 and 2015 had traveled extensively – under two different identities – as Igor Egorov ... between Moscow and the three control centers ...",
          "context": "Capital city from which operatives traveled and used as a transit/origin point for operations."
        }
      ]
    },
    {
      "entity_id": "E46",
      "canonical_name": "Crimea",
      "entity_type": "location",
      "aliases": [
        "Crimea"
      ],
      "mentions": [
        {
          "snippet": "The SBU's press release also alleged that Col. Egorov was a highly decorated KGB, and later FSB, officer who had received a medal for his role in annexing Crimea in 2014.",
          "context": "Region tied to Egorov's alleged medal and prior operations; also referenced in militants' memory of 'Elbrus'."
        }
      ]
    },
    {
      "entity_id": "E47",
      "canonical_name": "Caucasus",
      "entity_type": "location",
      "aliases": [
        "the Caucasus",
        "Caucasus region"
      ],
      "mentions": [
        {
          "snippet": "'Elbrus' – the name of a dormant volcano and Europe's highest mountain located in the tempestuous Caucasus on the border with Georgia.",
          "context": "Geographic explanation of the nom-de-guerre 'Elbrus'."
        }
      ]
    },
    {
      "entity_id": "E48",
      "canonical_name": "Georgia",
      "entity_type": "location",
      "aliases": [
        "Georgia"
      ],
      "mentions": [
        {
          "snippet": "'Elbrus' – the name of a dormant volcano ... located in the tempestuous Caucasus on the border with Georgia.",
          "context": "Neighbouring country to the Caucasus location of Mount Elbrus and connected to regional conflicts referenced."
        }
      ]
    },
    {
      "entity_id": "E49",
      "canonical_name": "Krasnodon",
      "entity_type": "location",
      "aliases": [
        "Krasnodon"
      ],
      "mentions": [
        {
          "snippet": "In another post from January 2015, he wrote that 'Elbrus' was based in Luhansk, and together with 'Delfin' – based in Krasnodon – were tasked with ... creating a new joint army ...",
          "context": "Named as the base of 'Delfin' and as a locus of pro-Russian operations."
        }
      ]
    },
    {
      "entity_id": "E50",
      "canonical_name": "Hamburg Gänsemarkt trip, February 2020",
      "entity_type": "event",
      "aliases": [
        "Hamburg meet-up February 2020",
        "Hamburg trip 10-12 February 2020"
      ],
      "mentions": [
        {
          "snippet": "He traveled at least 11 times to Germany – mostly to Frankfurt, Munich and Hamburg, with the latest trip to Hamburg being 10-12 February 2020. It was likely during this trip that he was secretly videotaped, as seen in the SBU press materials.",
          "context": "Specific recent travel event during which SBU alleges Egorov was videotaped meeting a would-be assassin."
        }
      ]
    },
    {
      "entity_id": "E51",
      "canonical_name": "Croatia trips by Egorov (2019)",
      "entity_type": "event",
      "aliases": [
        "Egorov travel to Croatia",
        "Croatia meet-ups 2019"
      ],
      "mentions": [
        {
          "snippet": "He also frequently flew to Croatia and France – and indeed, SBU's release alleges that these two countries were also used during 2019 as meet-ups between Egorov and his two Ukrainian assets.",
          "context": "Travel pattern used to suggest regular clandestine meet-ups across Europe."
        }
      ]
    },
    {
      "entity_id": "E52",
      "canonical_name": "Montenegro failed coup (2016)",
      "entity_type": "event",
      "aliases": [
        "failed coup in Montenegro",
        "2016 Montenegro coup attempt"
      ],
      "mentions": [
        {
          "snippet": "His longest stay was during a five-day trip in September 2016, one month before the failed coup in the mountainous Balkan state.",
          "context": "Places Egorov's travel timing in proximity to the 2016 Montenegro coup attempt."
        }
      ]
    },
    {
      "entity_id": "E53",
      "canonical_name": "Tivat",
      "entity_type": "location",
      "aliases": [
        "Tivat, Montenegro",
        "Tivat"
      ],
      "mentions": [
        {
          "snippet": "Other notable destinations include Montenegro – with four trips to the coastal town of Tivat, none of which long enough to qualify as a vacation getaway.",
          "context": "Specific Montenegrin town Egorov visited multiple times, highlighting suspicious travel patterns."
        }
      ]
    },
    {
      "entity_id": "E54",
      "canonical_name": "Tel Aviv",
      "entity_type": "location",
      "aliases": [
        "Tel Aviv"
      ],
      "mentions": [
        {
          "snippet": "Outside of Europe, Egorov traveled repeatedly to Tel Aviv, and once to Singapore.",
          "context": "Non-European travel destination that featured in Egorov's travel records."
        }
      ]
    },
    {
      "entity_id": "E55",
      "canonical_name": "Singapore",
      "entity_type": "location",
      "aliases": [
        "Singapore"
      ],
      "mentions": [
        {
          "snippet": "Outside of Europe, Egorov traveled repeatedly to Tel Aviv, and once to Singapore.",
          "context": "Listed as a singular non-European destination in Egorov's travel history."
        }
      ]
    },
    {
      "entity_id": "E56",
      "canonical_name": "Amman",
      "entity_type": "location",
      "aliases": [
        "Amman, Jordan",
        "Amman"
      ],
      "mentions": [
        {
          "snippet": "A trip to Jordan's capital Amman took place 3 weeks after Jordan's King Abdullah II visited the Kremlin ...",
          "context": "Timing of Egorov's travel to Jordan tied to royal Kremlin visit and military cooperation talks."
        }
      ]
    },
    {
      "entity_id": "E57",
      "canonical_name": "France",
      "entity_type": "location",
      "aliases": [
        "France"
      ],
      "mentions": [
        {
          "snippet": "Data from a visa processing database in Russia reviewed by Der Spiegel shows that in December 2016, Egorov applied for and received a multi-entry, four-year visa issued by France and valid for the Schengen area.",
          "context": "Country that issued Egorov a multi-entry Schengen visa used for his travel across Europe."
        }
      ]
    },
    {
      "entity_id": "E58",
      "canonical_name": "Schengen Area",
      "entity_type": "location",
      "aliases": [
        "Schengen area",
        "Schengen"
      ],
      "mentions": [
        {
          "snippet": "Data from a visa processing database in Russia reviewed by Der Spiegel shows that in December 2016, Egorov applied for and received a multi-entry, four-year visa issued by France and valid for the Schengen area.",
          "context": "Regional visa zone for which Egorov obtained multi-entry authorization enabling free travel in much of Europe."
        }
      ]
    },
    {
      "entity_id": "E59",
      "canonical_name": "Frankfurt",
      "entity_type": "location",
      "aliases": [
        "Frankfurt"
      ],
      "mentions": [
        {
          "snippet": "Booking records obtained by Bellingcat show that Col. Egorov had purchased one additional plane ticket to Germany – planning to fly from Moscow to Frankfurt on 4 March 2020 and stay there until 9 March 2020.",
          "context": "Named as a planned destination for Egorov that was later cancelled; part of the arrest/operation timeline."
        }
      ]
    },
    {
      "entity_id": "E60",
      "canonical_name": "Munich",
      "entity_type": "location",
      "aliases": [
        "Munich"
      ],
      "mentions": [
        {
          "snippet": "He traveled at least 11 times to Germany – mostly to Frankfurt, Munich and Hamburg, with the latest trip to Hamburg being 10-12 February 2020.",
          "context": "Listed among German cities Egorov visited frequently."
        }
      ]
    },
    {
      "entity_id": "E61",
      "canonical_name": "Paris",
      "entity_type": "location",
      "aliases": [
        "Paris"
      ],
      "mentions": [
        {
          "snippet": "Remarkably or coincidentally, Col. Egorov flew to Croatia just after Vadim Krasikov flew to Paris on route to his operation in Berlin.",
          "context": "Used to link temporal movements of operatives tied to the Berlin assassination."
        }
      ]
    },
    {
      "entity_id": "E62",
      "canonical_name": "Berlin",
      "entity_type": "location",
      "aliases": [
        "Berlin"
      ],
      "mentions": [
        {
          "snippet": "In our previous investigations, we determined that the FSB used current and former members of its Vympel/Department V Spetsnaz units to carry out the extraterritorial assassination of Zelimkhan Khangoshvili in Berlin.",
          "context": "City where a high-profile extraterritorial assassination occurred."
        }
      ]
    },
    {
      "entity_id": "E63",
      "canonical_name": "Kyiv",
      "entity_type": "location",
      "aliases": [
        "Kyiv",
        "Kiev",
        "Kyiv, Ukraine"
      ],
      "mentions": [
        {
          "snippet": "Both targets had taken part in active warfare against Russian forces – Khangosvili had taken part ... while Adam Osmaev was an officer, and since February 2015, the commander ... who fought in key battles against Russian forces and pro-Russian militants in Eastern Ukraine in 2014 and 2015.",
          "context": "Capital of Ukraine, location of assassination attempts (e.g., 2017 attempts against Osmaev) and base for exiled Chechens."
        },
        {
          "snippet": "Osmaev was the target of two assassination attempts in Kyiv in 2017 – the second of which killed his wife ... Amina Okueva.",
          "context": "Site of attempts on Osmaev's life."
        }
      ]
    },
    {
      "entity_id": "E64",
      "canonical_name": "Cente for Specialized Equipment",
      "entity_type": "organization",
      "aliases": [
        "Cente for Specialized Equipment",
        "Center for Specialized Equipment (as spelled)"
      ],
      "mentions": [
        {
          "snippet": "Corporate registries show him as owner and 'liquidator' of a company named 'Cente for Specialized Equipment', founded in 2012 and currently in liquidation.",
          "context": "Commercial front company allegedly linked to Egorov used for visa/employment cover."
        }
      ]
    },
    {
      "entity_id": "E65",
      "canonical_name": "Schengen police",
      "entity_type": "organization",
      "aliases": [
        "Schengen police"
      ],
      "mentions": [
        {
          "snippet": "A police alert record seen by our investigative partner Der Spiegel shows that no later than March 2020, French law enforcement had sent a 'track but do not arrest' alert on Egorov to Schengen police, referencing a 'cross-border criminal investigation'.",
          "context": "Regional policing network reportedly alerted to Egorov with specific instructions not to arrest but to track."
        }
      ]
    },
    {
      "entity_id": "E66",
      "canonical_name": "Coronavirus crisis / COVID-19 pandemic",
      "entity_type": "concept",
      "aliases": [
        "coronavirus crisis",
        "COVID-19 pandemic",
        "coronavirus"
      ],
      "mentions": [
        {
          "snippet": "This trip did not materialize, however, due to the impending coronavirus crisis and restrictions on movements.",
          "context": "Cited as a reason travel and planned arrest operations were disrupted in early 2020."
        }
      ]
    },
    {
      "entity_id": "E67",
      "canonical_name": "BUK missile",
      "entity_type": "concept",
      "aliases": [
        "BUK missile",
        "Russian BUK missile"
      ],
      "mentions": [
        {
          "snippet": "Given that his arrival was just prior to the tragic shoot-down of MH17 by a Russian BUK missile, such role makes Elbrus a person of interest in the MH17 investigation.",
          "context": "Weapon system implicated in MH17's downing and used to frame possible involvement of 'Elbrus'."
        }
      ]
    },
    {
      "entity_id": "E68",
      "canonical_name": "Extrajudicial / extraterritorial assassinations",
      "entity_type": "concept",
      "aliases": [
        "extraterritorial assassination",
        "extraterritorial eliminations",
        "exraterritorial assassination operations"
      ],
      "mentions": [
        {
          "snippet": "The new disclosure that the FSB's Col. Egorov, also a Vympel operative, was plotting the assassination of another Chechen living in exile, suggests that these operations are part of a longer running strategy of extraterritorial eliminations.",
          "context": "Conceptual theme of the report: use of off-shore killings by FSB-linked units against exiles."
        }
      ]
    },
    {
      "entity_id": "E69",
      "canonical_name": "kurator (Russian special service supervisor)",
      "entity_type": "concept",
      "aliases": [
        "kurator",
        "kurator (Russian special service parlance)"
      ],
      "mentions": [
        {
          "snippet": "In our previous investigations ... we had stumbled upon this person, who in 2014 and 2015 had traveled extensively ... one of the key Russian military supervisors (or kurator, in Russian special service parlance) in the Donbass ...",
          "context": "Explains the role/title used in Russian services for operatives supervising proxies in Donbass, applied to 'Elbrus'/'Orion' figures."
        }
      ]
    },
    {
      "entity_id": "E70",
      "canonical_name": "Operational security tradecraft (double-booking flights)",
      "entity_type": "concept",
      "aliases": [
        "operational security trade-craft",
        "double-booking flights decoy"
      ],
      "mentions": [
        {
          "snippet": "Secondly, the two also mimicked each other's operational security trade-craft – both would travel from Moscow to Rostov, Simferopol or Krasnodar under their true identities, but would sometimes double-book a return flight to Moscow both under their real name and under their cover identity.",
          "context": "Describes a described tactic allegedly used by high-value operatives (decoy double-booking) to obscure movements."
        }
      ]
    },
    {
      "entity_id": "E71",
      "canonical_name": "Delfin and Elbrus attempted consolidation (Nov 2014)",
      "entity_type": "event",
      "aliases": [
        "Delfin and Elbrus failed consolidation November 2014",
        "Nov 2014 LNR consolidation attempt"
      ],
      "mentions": [
        {
          "snippet": "The earliest public reference to 'Elbrus' came from the separatist blogger ... who in November 2014 first wrote about the failed attempt by two Moscow-installed military commanders – 'Delfin' and 'Elbrus' – to consolidate the more than 20 disparate and infighting pro-Russian armed groups ...",
          "context": "Named incident where nom-de-guerre commanders attempted to reorganize pro-Russian forces in Luhansk region."
        }
      ]
    },
    {
      "entity_id": "E72",
      "canonical_name": "Croatia",
      "entity_type": "location",
      "aliases": [
        "Croatia"
      ],
      "mentions": [
        {
          "snippet": "He also frequently flew to Croatia and France – and indeed, SBU's release alleges that these two countries were also used during 2019 as meet-ups between Egorov and his two Ukrainian assets.",
          "context": "Country used for alleged clandestine meet-ups and frequent travel by Egorov."
        }
      ]
    },
    {
      "entity_id": "E73",
      "canonical_name": "France (visa issuance)",
      "entity_type": "event",
      "aliases": [
        "French visa issuance December 2016",
        "France visa 2016"
      ],
      "mentions": [
        {
          "snippet": "Data from a visa processing database in Russia reviewed by Der Spiegel shows that in December 2016, Egorov applied for and received a multi-entry, four-year visa issued by France and valid for the Schengen area.",
          "context": "Specific administrative action enabling Egorov's freer travel across Europe."
        }
      ]
    },
    {
      "entity_id": "E74",
      "canonical_name": "Cente for Specialized Equipment (company) liquidation",
      "entity_type": "event",
      "aliases": [
        "company liquidation Cente for Specialized Equipment"
      ],
      "mentions": [
        {
          "snippet": "Corporate registries show him as owner and 'liquidator' of a company named 'Cente for Specialized Equipment', founded in 2012 and currently in liquidation.",
          "context": "Corporate registration detail suggesting a possible employment front used by Egorov."
        }
      ]
    }
  ],
  "metadata": {
    "report_id": "report3_bellingcat_fsb_elbrus",
    "total_entities_extracted": 74,
    "extraction_timestamp": "2025-11-17T11:58:45.799468+00:00"
  }
}