{
  "entities": [
    {
      "entity_id": "E1",
      "canonical_name": "Yana Yerlashova",
      "entity_type": "person",
      "aliases": [
        "Yerlashova",
        "Yana"
      ],
      "mentions": [
        {
          "snippet": "Bonanza Media ... was founded in early 2019 by former RT journalist Yana Yerlashova with the help of Dutch blogger Max van der Werff",
          "context": "Identified as Bonanza Media's founder and former RT journalist who coordinated the project's activity and exchanged communications with GRU officers."
        },
        {
          "snippet": "Using two different email accounts, Yerlashova sent Col. Chebanov draft articles intended for publication on the Bonanza Media website",
          "context": "Sent draft materials to GRU Colonel Sergey Chebanov for review/coordination prior to publication."
        },
        {
          "snippet": "We made multiple attempts to reach Yana Yerlashova by telephone; she either did not answer the calls or was unreachable.",
          "context": "Investigation attempted to contact her about Bonanza Media's relationship with the GRU but received no substantive response."
        },
        {
          "snippet": "Yerlashova and the van der Werff settled down in what appears to be a makeshift studio in Russia for a promised live stream.",
          "context": "Participated in fundraising and public outreach for Bonanza Media and planned travel to eastern Ukraine."
        }
      ]
    },
    {
      "entity_id": "E2",
      "canonical_name": "Max van der Werff",
      "entity_type": "person",
      "aliases": [
        "van der Werff",
        "Max",
        "Van der Werff"
      ],
      "mentions": [
        {
          "snippet": "Bonanza Media ... was founded in early 2019 by former RT journalist Yana Yerlashova with the help of Dutch blogger Max van der Werff",
          "context": "Co-founder/helped found Bonanza Media; obtained Dutch press credentials in May 2019 and collaborated closely with Yerlashova."
        },
        {
          "snippet": "On 6 January 2020 ... Max van der Werff posted the following message on Facebook announcing a need to travel to eastern Ukraine again",
          "context": "Publicly solicited travel and fundraising for Bonanza Media's work related to MH17."
        },
        {
          "snippet": "The passport copy he emailed was that of Bonanza Media's Max van der Werff.",
          "context": "His passport photocopy was exchanged between Bonanza and GRU officers, indicating GRU access to his identity documents."
        },
        {
          "snippet": "Contacted repeatedly via Twitter, Max van der Werff refused to answer our questions",
          "context": "Investigators attempted to question him about potential cooperation with the GRU but received no answers."
        }
      ]
    },
    {
      "entity_id": "E3",
      "canonical_name": "Mahathir Mohamad",
      "entity_type": "person",
      "aliases": [
        "Mahathir"
      ],
      "mentions": [
        {
          "snippet": "the team crisscrossed between Malaysia (including an interview with then Malaysian Prime Minister Mahathir Mohamad)",
          "context": "Bonanza Media conducted an interview with Malaysia's then-Prime Minister during its activities."
        }
      ]
    },
    {
      "entity_id": "E4",
      "canonical_name": "Oleg Pulatov",
      "entity_type": "person",
      "aliases": [
        "Pulatov"
      ],
      "mentions": [
        {
          "snippet": "The defense team of Oleg Pulatov – the only legally represented suspect in the ongoing criminal trial – has already introduced in court evidence provided by Bonanza Media",
          "context": "Named as the defendant whose defense team used Bonanza Media material in the MH17 criminal trial."
        }
      ]
    },
    {
      "entity_id": "E5",
      "canonical_name": "Sergey Chebanov",
      "entity_type": "person",
      "aliases": [
        "Col. Sergey Chebanov",
        "Col. Chebanov",
        "Chebanov"
      ],
      "mentions": [
        {
          "snippet": "No later than the summer of 2019 ... Col. Sergey Chebanov – a graduate of Russia's Military Intelligence Academy ... was receiving regular updates about Bonanza's plans",
          "context": "Identified as a senior GRU officer who coordinated regularly with Yerlashova and received Bonanza Media materials."
        },
        {
          "snippet": "During most of the phone calls with Yerlashova, cell-tower data shows, he was based at the GRU headquarters at Khoroshevskoe Shosse 76B in Moscow.",
          "context": "Phone metadata places Chebanov at GRU headquarters during communications with Bonanza personnel."
        },
        {
          "snippet": "Using two different email accounts, Yerlashova sent Col. Chebanov draft articles intended for publication on the Bonanza Media website",
          "context": "Received and reviewed Bonanza draft content and promotional materials prior to publication."
        },
        {
          "snippet": "An email from 9 October 2019, sent to Col. Chebanov from an email account belonging to another GRU officer, contained two attachments, one named 'Letter to Higgins' ...",
          "context": "Chebanov's mailbox contained correspondence referencing outreach to Bellingcat’s Higgins and invitations related to Bonanza events."
        }
      ]
    },
    {
      "entity_id": "E6",
      "canonical_name": "Vitaliy Biryukov",
      "entity_type": "person",
      "aliases": [
        "Biryukov",
        "Vitaliy"
      ],
      "mentions": [
        {
          "snippet": "She also emailed him a photo of the passport of Bonanza Media's camera man, RT staffer Vitaliy Biryukov, who formerly worked for Zvezda (a TV network run by the Russian Ministry of Defence).",
          "context": "Identified as Bonanza Media's cameraman and an RT staffer whose passport copy was circulated to GRU officers."
        }
      ]
    },
    {
      "entity_id": "E7",
      "canonical_name": "Andrey Ilchenko",
      "entity_type": "person",
      "aliases": [
        "Gen. Ilchenko",
        "Maj. General Andrey Ilchenko",
        "Ilchenko"
      ],
      "mentions": [
        {
          "snippet": "Shortly after receiving the two passports, Col. Chebanov called his colleague – Maj. General Andrey Ilchenko, a trusted associate of GRU's current chief Igor Kostyukov.",
          "context": "Named as a senior GRU general who coordinated logistics and liaised with LNR contacts to arrange Bonanza Media access to Donbas."
        },
        {
          "snippet": "At 12:22, Andrey Ilchenko sent a series of text messages to Anna Soroka, a self-styled deputy minister of foreign affairs of the unrecognized Lugansk People's Republic",
          "context": "Communicated with local separatist official Anna Soroka about coordinating Bonanza Media entry and filming in LNR territory."
        },
        {
          "snippet": "Ilchenko returned from Rostov-on-Don to Moscow on 19 January, and, based on several calls between him and Yerlashova the next day, the Bonanza Media team made it back by car on 20 January 2020.",
          "context": "Physically facilitated or accompanied Bonanza Media movements near the Russia–Ukraine border and in Rostov."
        }
      ]
    },
    {
      "entity_id": "E8",
      "canonical_name": "Igor Kostyukov",
      "entity_type": "person",
      "aliases": [
        "Kostyukov",
        "GRU's current chief Igor Kostyukov"
      ],
      "mentions": [
        {
          "snippet": "Maj. General Andrey Ilchenko, a trusted associate of GRU's current chief Igor Kostyukov.",
          "context": "Referenced as the GRU chief to whom Ilchenko is a trusted associate, providing hierarchy context within GRU."
        }
      ]
    },
    {
      "entity_id": "E9",
      "canonical_name": "Anna Soroka",
      "entity_type": "person",
      "aliases": [
        "Soroka",
        "Anna"
      ],
      "mentions": [
        {
          "snippet": "At 12:22, Andrey Ilchenko sent a series of text messages to Anna Soroka, a self-styled deputy minister of foreign affairs of the unrecognized Lugansk People's Republic in Russian-occupied eastern Ukraine.",
          "context": "Described as a high-ranking LNR official used by GRU officers to arrange Bonanza Media access to separatist-controlled Donbas."
        },
        {
          "snippet": "\"I would need to coordinate them. Who are they – from which channel are they – where are they going to show the recorded footage? Who controls them? These are the minimum questions that the FSB guys will ask.\"",
          "context": "Her reply shows she sought clearance from FSB and Presidential Administration for allowing journalists into LNR."
        }
      ]
    },
    {
      "entity_id": "E10",
      "canonical_name": "Eric van de Beek",
      "entity_type": "person",
      "aliases": [
        "Van de Beek",
        "Eric"
      ],
      "mentions": [
        {
          "snippet": "On 3 May 2020 Yana Yerlashova emailed Col. Chebanov a draft article written by Bonanza Media's hired Dutch contributor Eric van de Beek.",
          "context": "Worked as a Dutch contributor to Bonanza; his draft article was forwarded to GRU and published with edits that increased attacks on Bellingcat."
        },
        {
          "snippet": "Formerly a journalist working for the Dutch Elsevier magazine, Eric van de Beek has a track record of voicing support for conspiracy theories",
          "context": "Background context about his media history and conspiratorial views."
        }
      ]
    },
    {
      "entity_id": "E11",
      "canonical_name": "Elena Plotnikova",
      "entity_type": "person",
      "aliases": [
        "Plotnikova",
        "Elena"
      ],
      "mentions": [
        {
          "snippet": "The teaser, prepared by the event's UK organizer Theo Russell, was initially sent for Yerlashova's approval by a Bonanza media collaborator named Elena Plotnikova.",
          "context": "Identified as a Netherlands-based Ukrainian pro-Kremlin activist and Bonanza collaborator involved in promotional materials."
        },
        {
          "snippet": "Plotnikova is a vocal Netherlands-based Ukrainian pro-Kremlin activist and member of an opaquely funded organization called 'Global Rights for Peaceful People'.",
          "context": "Member of Global Rights for Peaceful People and active in pro-Kremlin messaging for Bonanza."
        }
      ]
    },
    {
      "entity_id": "E12",
      "canonical_name": "Theo Russell",
      "entity_type": "person",
      "aliases": [
        "Russell",
        "Theo"
      ],
      "mentions": [
        {
          "snippet": "the public screening of Bonanza Media's documentary scheduled for 3 March 2020 in London. The teaser, prepared by the event's UK organizer Theo Russell, was initially sent ...",
          "context": "Named as the UK organizer of a Bonanza Media public screening promotional teaser."
        }
      ]
    },
    {
      "entity_id": "E13",
      "canonical_name": "Tatyana Egorova",
      "entity_type": "person",
      "aliases": [
        "Egorova",
        "Tatyana"
      ],
      "mentions": [
        {
          "snippet": "In 2016, a leak appeared online from Tatyana Egorova, a staff member of the so-called Donetsk People's Republic's (DNR's) Ministry of Information.",
          "context": "Her Mail.ru inbox leaks (Egorova Leaks) contained correspondence with Max van der Werff and others about MH17 messaging."
        }
      ]
    },
    {
      "entity_id": "E14",
      "canonical_name": "Eliot Higgins",
      "entity_type": "person",
      "aliases": [
        "Higgins"
      ],
      "mentions": [
        {
          "snippet": "An email ... contained two attachments, one named 'Letter to Higgins' and the other 'Invitation to Higgins to a conference on 29 October 2019'.",
          "context": "Reference to outreach/invitation to Higgins, the founder of Bellingcat, indicating GRU interest in engaging or targeting him."
        }
      ]
    },
    {
      "entity_id": "E15",
      "canonical_name": "Julian Assange",
      "entity_type": "person",
      "aliases": [
        "Assange"
      ],
      "mentions": [
        {
          "snippet": "See the case of Julian Assange, WikiLeaks.",
          "context": "Van der Werff referenced WikiLeaks/Assange as a justification for source protection when asked about document origins."
        }
      ]
    },
    {
      "entity_id": "E16",
      "canonical_name": "Bonanza Media",
      "entity_type": "organization",
      "aliases": [
        "Bonanza",
        "Bonanza Media project",
        "Bonanza Media Twitter account"
      ],
      "mentions": [
        {
          "snippet": "An investigation by Bellingcat ... has discovered evidence that Bonanza Media, a self-styled independent investigative platform, is in fact a special disinformation project",
          "context": "Central subject of the report; presented as a media project used for GRU-linked disinformation targeting the MH17 investigation."
        },
        {
          "snippet": "the Bonanza Media twitter account even posted a jab at would-be Russian donors",
          "context": "Operated social media and fundraising campaigns while presenting itself as independent."
        },
        {
          "snippet": "Bonanza Media published a streak of what it said were 'leaks' from internal documents of the JIT.",
          "context": "Published stolen JIT documents and coordinated leaks that were used in information operations."
        },
        {
          "snippet": "Recently, Bonanza Media has pivoted to include disinformation around Covid-19 through a video series 'REALITYcheck'",
          "context": "Expanded from MH17-related narratives into Covid-19 disinformation and testimonial video series."
        }
      ]
    },
    {
      "entity_id": "E17",
      "canonical_name": "Main Intelligence Directorate (GRU)",
      "entity_type": "organization",
      "aliases": [
        "GRU",
        "Russia's military intelligence",
        "Russian military intelligence"
      ],
      "mentions": [
        {
          "snippet": "the Russia's military intelligence agency, best known as the GRU, was behind the initial launch and funding of the Bonanza Media project",
          "context": "Accused of coordinating with and directing Bonanza Media as part of disinformation operations related to MH17."
        },
        {
          "snippet": "The GRU received advance copies of Bonanza's publications, provided its employees illegal cross-border access into eastern Ukraine, furnished the project with confidential internal documents ... that were hacked by GRU's cyber warfare division",
          "context": "Described as source of hacked JIT documents, logistic support, and active coordination with Bonanza."
        }
      ]
    },
    {
      "entity_id": "E18",
      "canonical_name": "GRU cyber warfare division",
      "entity_type": "unit",
      "aliases": [
        "cyber warfare division",
        "GRU's cyber warfare division"
      ],
      "mentions": [
        {
          "snippet": "confidential internal documents of the official Dutch-led MH17 Joint Investigation Team ... that were hacked by GRU's cyber warfare division",
          "context": "Identified as the GRU unit that hacked JIT documents which Bonanza later published as 'leaks'."
        }
      ]
    },
    {
      "entity_id": "E19",
      "canonical_name": "Joint Investigation Team (JIT)",
      "entity_type": "organization",
      "aliases": [
        "JIT",
        "MH17 Joint Investigation Team",
        "the official Dutch-led MH17 Joint Investigation Team"
      ],
      "mentions": [
        {
          "snippet": "the official Dutch-led MH17 Joint Investigation Team conducting the official criminal investigation into the deaths of 298 passengers and crew",
          "context": "International investigative body responsible for the MH17 criminal investigation whose internal documents were leaked."
        }
      ]
    },
    {
      "entity_id": "E20",
      "canonical_name": "Bellingcat",
      "entity_type": "organization",
      "aliases": [
        "Bellingcat Investigation Team",
        "Bellingcat"
      ],
      "mentions": [
        {
          "snippet": "An investigation by Bellingcat and its investigative partners has discovered evidence that Bonanza Media ...",
          "context": "Authoring investigative organization that conducted this analysis into Bonanza Media and GRU operations."
        },
        {
          "snippet": "Formerly a journalist ... Eric van de Beek ... declaring on 14 April 2018 that he refuses to read any Bellingcat article.",
          "context": "Target of criticism by Bonanza contributors; referenced as the independent investigative outlet that authored the report."
        }
      ]
    },
    {
      "entity_id": "E21",
      "canonical_name": "RT (Russia Today)",
      "entity_type": "organization",
      "aliases": [
        "RT",
        "Russia's state-run outlet RT"
      ],
      "mentions": [
        {
          "snippet": "Working for Russia's state-run outlet RT, Yana Yerlashova had authored documentaries critical of the Dutch-led investigation",
          "context": "Yerlashova’s previous employer; state media outlet implicated in promoting narratives skeptical of JIT findings."
        },
        {
          "snippet": "Bonanza Media's camera man, RT staffer Vitaliy Biryukov",
          "context": "RT connection via Biryukov indicates personnel overlap between Bonanza and Russian state media."
        }
      ]
    },
    {
      "entity_id": "E22",
      "canonical_name": "Donetsk People's Republic",
      "entity_type": "organization",
      "aliases": [
        "DNR",
        "Donetsk People's Republic (DNR)"
      ],
      "mentions": [
        {
          "snippet": "a leak appeared online from Tatyana Egorova, a staff member of the so-called Donetsk People's Republic's (DNR's) Ministry of Information.",
          "context": "Self-proclaimed separatist authority in eastern Ukraine whose official's email leaks contained correspondence with van der Werff."
        }
      ]
    },
    {
      "entity_id": "E23",
      "canonical_name": "Luhansk People's Republic",
      "entity_type": "organization",
      "aliases": [
        "LNR",
        "Lugansk People's Republic",
        "Luhansk People's Republic (LNR)"
      ],
      "mentions": [
        {
          "snippet": "Anna Soroka, a self-styled deputy minister of foreign affairs of the unrecognized Lugansk People's Republic in Russian-occupied eastern Ukraine.",
          "context": "Self-proclaimed LNR official who coordinated with GRU officers about Bonanza Media entering and filming in LNR territory."
        }
      ]
    },
    {
      "entity_id": "E24",
      "canonical_name": "Russia's Ministry of Defence",
      "entity_type": "organization",
      "aliases": [
        "Russian Ministry of Defence",
        "Ministry of Defence"
      ],
      "mentions": [
        {
          "snippet": "Zvezda (a TV network run by the Russian Ministry of Defence).",
          "context": "Identifies Zvezda as operated by the Russian Ministry of Defence, providing a link between state military media and Bonanza personnel."
        }
      ]
    },
    {
      "entity_id": "E25",
      "canonical_name": "Zvezda (TV network)",
      "entity_type": "organization",
      "aliases": [
        "Zvezda"
      ],
      "mentions": [
        {
          "snippet": "RT staffer Vitaliy Biryukov, who formerly worked for Zvezda (a TV network run by the Russian Ministry of Defence).",
          "context": "Named as Biryukov's former employer, linking him to military-run media."
        }
      ]
    },
    {
      "entity_id": "E26",
      "canonical_name": "Global Rights for Peaceful People",
      "entity_type": "organization",
      "aliases": [
        "Global Rights for Peaceful People"
      ],
      "mentions": [
        {
          "snippet": "Plotnikova is ... member of an opaquely funded organization called 'Global Rights for Peaceful People' whose main mission ... is defending the Russia-supported separatists in eastern Ukraine.",
          "context": "Organization linked to Elena Plotnikova and pro-Kremlin advocacy related to Donbas narratives."
        }
      ]
    },
    {
      "entity_id": "E27",
      "canonical_name": "Federal Security Service",
      "entity_type": "organization",
      "aliases": [
        "FSB",
        "the FSB guys"
      ],
      "mentions": [
        {
          "snippet": "Who controls them? ... These are the minimum questions that the FSB guys will ask.",
          "context": "Referenced as needing to be consulted/cleared for journalists entering LNR territory; shows FSB's role in border/control issues."
        },
        {
          "snippet": "After an initial scuffle between the FSB and GRU for political and economic control over the two Russian-backed separatist territories ... by the end of 2014 the FSB had gotten the upper hand.",
          "context": "Context about inter-agency competition between FSB and GRU over influence in separatist regions."
        }
      ]
    },
    {
      "entity_id": "E28",
      "canonical_name": "Presidential Administration of Russia",
      "entity_type": "organization",
      "aliases": [
        "AP",
        "Russia's Presidential Administration",
        "the AP (Russia's Presidential Administration)"
      ],
      "mentions": [
        {
          "snippet": "We must position it all to the FSB and the AP (Russia's Presidential Administration) in such a way that they should see what's in it for them",
          "context": "Anna Soroka recommended seeking clearance from both the FSB and the Presidential Administration, indicating Kremlin-level oversight."
        }
      ]
    },
    {
      "entity_id": "E29",
      "canonical_name": "NRC Handelsblad",
      "entity_type": "organization",
      "aliases": [
        "NRC",
        "Dutch NRC"
      ],
      "mentions": [
        {
          "snippet": "Asked about the origin of the documents by a Dutch NRC journalist, Van der Werff answered: 'Bonanza Media only makes statements ...'",
          "context": "NRC is the Dutch newspaper whose journalist questioned Van der Werff about the source of the leaked JIT documents."
        }
      ]
    },
    {
      "entity_id": "E30",
      "canonical_name": "Elsevier",
      "entity_type": "organization",
      "aliases": [
        "Elsevier magazine",
        "the Dutch Elsevier magazine"
      ],
      "mentions": [
        {
          "snippet": "Formerly a journalist working for the Dutch Elsevier magazine, Eric van de Beek has a track record ...",
          "context": "Provides background on Eric van de Beek's previous employer and media credentials."
        }
      ]
    },
    {
      "entity_id": "E31",
      "canonical_name": "WikiLeaks",
      "entity_type": "organization",
      "aliases": [
        "WikiLeaks"
      ],
      "mentions": [
        {
          "snippet": "See the case of Julian Assange, WikiLeaks.",
          "context": "Referenced by Van der Werff as precedent to justify non-disclosure of sources for leaked documents."
        }
      ]
    },
    {
      "entity_id": "E32",
      "canonical_name": "Patreon",
      "entity_type": "organization",
      "aliases": [
        "Patreon"
      ],
      "mentions": [
        {
          "snippet": "they asked for more donations – via Patreon or directly to Van der Werff's Dutch bank account number, to be able to pay for this trip.",
          "context": "Platform used by Bonanza to solicit donations for travel and operations."
        }
      ]
    },
    {
      "entity_id": "E33",
      "canonical_name": "Twitter",
      "entity_type": "organization",
      "aliases": [
        "Twitter",
        "the Bonanza Media twitter account"
      ],
      "mentions": [
        {
          "snippet": "The Bonanza Media Twitter account even posted a jab at would-be Russian donors",
          "context": "Social media platform used for messaging and fundraising by Bonanza Media."
        },
        {
          "snippet": "Contacted repeatedly via Twitter, Max van der Werff refused to answer our questions",
          "context": "Investigators attempted to contact Bonanza personnel via Twitter."
        }
      ]
    },
    {
      "entity_id": "E34",
      "canonical_name": "REALITYcheck",
      "entity_type": "concept",
      "aliases": [
        "REALITYcheck (video series)"
      ],
      "mentions": [
        {
          "snippet": "Recently, Bonanza Media has pivoted to include disinformation around Covid-19 through a video series 'REALITYcheck' ...",
          "context": "Name of Bonanza Media's video series used to spread Covid-19 related disinformation and testimonials."
        }
      ]
    },
    {
      "entity_id": "E35",
      "canonical_name": "Covid-19 disinformation",
      "entity_type": "concept",
      "aliases": [
        "Covid-19 disinformation",
        "coronavirus disinformation"
      ],
      "mentions": [
        {
          "snippet": "Bonanza Media has pivoted away from purely MH17-linked topics towards Covid-19 disinformation.",
          "context": "Describes the project's expansion into pandemic-related misinformation."
        }
      ]
    },
    {
      "entity_id": "E36",
      "canonical_name": "Donbas",
      "entity_type": "location",
      "aliases": [
        "Donbas Region",
        "the Donbas"
      ],
      "mentions": [
        {
          "snippet": "sympathetic to the Russia-supported separatists in the Donbas Region of eastern Ukraine",
          "context": "Region where separatist authorities are located and where Bonanza carried out fieldwork and filming."
        }
      ]
    },
    {
      "entity_id": "E37",
      "canonical_name": "Malaysia",
      "entity_type": "location",
      "aliases": [
        "Malaysia"
      ],
      "mentions": [
        {
          "snippet": "analysis ... shows they were likely to be obtained from a hack of one of the JIT member countries' offices, Malaysia.",
          "context": "JIT member country whose office may have been hacked to obtain documents leaked by Bonanza."
        },
        {
          "snippet": "the team crisscrossed between Malaysia (including an interview with then Malaysian Prime Minister Mahathir Mohamad)",
          "context": "Country where Bonanza conducted interviews and commissioned a cybersecurity study."
        }
      ]
    },
    {
      "entity_id": "E38",
      "canonical_name": "Netherlands",
      "entity_type": "location",
      "aliases": [
        "the Netherlands",
        "Netherlands"
      ],
      "mentions": [
        {
          "snippet": "produced ... hosted and attended several press conferences and events in the Netherlands, the U.K. and Malaysia;",
          "context": "Location where Bonanza held events and screenings and where much of the JIT leadership is based."
        },
        {
          "snippet": "Asked about the origin of the documents by a Dutch NRC journalist",
          "context": "Home country of investigators and media who questioned Bonanza about the leaks."
        }
      ]
    },
    {
      "entity_id": "E39",
      "canonical_name": "United Kingdom",
      "entity_type": "location",
      "aliases": [
        "U.K.",
        "United Kingdom"
      ],
      "mentions": [
        {
          "snippet": "produced ... hosted and attended several press conferences and events in the Netherlands, the U.K. and Malaysia;",
          "context": "Country where Bonanza held events and screenings (example: London screening organized by Theo Russell)."
        }
      ]
    },
    {
      "entity_id": "E40",
      "canonical_name": "Russia",
      "entity_type": "location",
      "aliases": [
        "Russian",
        "Russia"
      ],
      "mentions": [
        {
          "snippet": "evidence that Bonanza Media ... is in fact a special disinformation project working in coordination with Russia's military intelligence.",
          "context": "Country whose military intelligence (GRU) is implicated in coordinating the disinformation operation."
        },
        {
          "snippet": "they crisscrossed between Malaysia, Russia, Russian-occupied eastern Ukraine, and the Netherlands;",
          "context": "Country where Bonanza operated, sourced personnel, and where GRU headquarters is located."
        }
      ]
    },
    {
      "entity_id": "E41",
      "canonical_name": "Ukraine",
      "entity_type": "location",
      "aliases": [
        "Ukraine"
      ],
      "mentions": [
        {
          "snippet": "provided its employees illegal cross-border access into eastern Ukraine",
          "context": "Country where Bonanza sought access to film witnesses in separatist-controlled areas related to MH17 investigation."
        }
      ]
    },
    {
      "entity_id": "E42",
      "canonical_name": "Hague District Court",
      "entity_type": "location",
      "aliases": [
        "Hague District Court",
        "the Hague District Court",
        "Hague"
      ],
      "mentions": [
        {
          "snippet": "timed to sow confusion just before the start of the criminal trial at the Hague District Court in early 2020.",
          "context": "Court venue for the MH17 criminal trial where Bonanza-supplied material was relevant to defense evidence."
        }
      ]
    },
    {
      "entity_id": "E43",
      "canonical_name": "The Hague",
      "entity_type": "location",
      "aliases": [
        "Hague",
        "The Hague"
      ],
      "mentions": [
        {
          "snippet": "contained images and texts from an invitation to a public screening of Bonanza's documentary in the Hague, scheduled for 23 October 2019.",
          "context": "City where Bonanza organized public screenings and outreach tied to the MH17 narrative."
        }
      ]
    },
    {
      "entity_id": "E44",
      "canonical_name": "Rostov-on-Don",
      "entity_type": "location",
      "aliases": [
        "Rostov-on-Don",
        "Rostov"
      ],
      "mentions": [
        {
          "snippet": "The next day – on 14 January 2020 – the Bonanza Team had arrived in Rostov-on-Don.",
          "context": "Staging city near the Russia–Ukraine border where Bonanza and GRU contacts coordinated movements."
        }
      ]
    },
    {
      "entity_id": "E45",
      "canonical_name": "Platov Airport",
      "entity_type": "location",
      "aliases": [
        "Rostov's Platov airport",
        "Platov airport"
      ],
      "mentions": [
        {
          "snippet": "Ilchenko departed by plane to Rostov-on-Don, ... and switched on his phone at Rostov's Platov airport just after 4 pm.",
          "context": "Airport where Ilchenko's phone activity was recorded during movement to Rostov-on-Don."
        }
      ]
    },
    {
      "entity_id": "E46",
      "canonical_name": "Sheremetyevo Airport",
      "entity_type": "location",
      "aliases": [
        "Sheremetyevo"
      ],
      "mentions": [
        {
          "snippet": "On the way to Sheremetyevo airport, he stopped by a phone store – presumably to buy a new SIM card",
          "context": "Major Moscow airport where Ilchenko bought a SIM card used in covert communications."
        }
      ]
    },
    {
      "entity_id": "E47",
      "canonical_name": "Donetsk (Russia)",
      "entity_type": "location",
      "aliases": [
        "Donetsk (Russia)",
        "Donetsk border town"
      ],
      "mentions": [
        {
          "snippet": "They were geolocated near the border town of Donetsk (Russia), where a major border crossing point between Russia and the Donbas lies, at about 11 am on 16 January.",
          "context": "Specific border-area location where Bonanza and GRU-related movements were recorded en route to separatist territories."
        }
      ]
    },
    {
      "entity_id": "E48",
      "canonical_name": "Shchelkovo",
      "entity_type": "location",
      "aliases": [
        "Shchelkovo",
        "the village of Shchelkovo"
      ],
      "mentions": [
        {
          "snippet": "Cell phone metadata shows Ilchenko was near a SIGINT military base in the village of Shchelkovo near Moscow, where he would stay for the next two days.",
          "context": "Location of a SIGINT military base where Ilchenko was geolocated, indicating military signals intelligence involvement."
        }
      ]
    },
    {
      "entity_id": "E49",
      "canonical_name": "Khoroshevskoe Shosse 76B",
      "entity_type": "location",
      "aliases": [
        "Khoroshevskoe Shosse 76B",
        "GRU headquarters at Khoroshevskoe Shosse 76B"
      ],
      "mentions": [
        {
          "snippet": "During most of the phone calls with Yerlashova, cell-tower data shows, he was based at the GRU headquarters at Khoroshevskoe Shosse 76B in Moscow.",
          "context": "Physical address of GRU headquarters used to geolocate Chebanov and other GRU communications."
        }
      ]
    },
    {
      "entity_id": "E50",
      "canonical_name": "53rd Anti-Aircraft Missile Brigade",
      "entity_type": "unit",
      "aliases": [
        "53rd Anti-Aircraft Missile Brigade",
        "53rd Anti-Aircraft Brigade"
      ],
      "mentions": [
        {
          "snippet": "the Buk missile launcher that shot down MH17 belonged to, and was possibly also operated by, an active Russian military unit – the 53rd Anti-Aircraft Missile Brigade.",
          "context": "Identified as the military unit owning/operating the Buk launcher implicated in the MH17 shootdown."
        }
      ]
    },
    {
      "entity_id": "E51",
      "canonical_name": "Buk missile launcher",
      "entity_type": "concept",
      "aliases": [
        "Buk missile launcher",
        "Buk missile system"
      ],
      "mentions": [
        {
          "snippet": "This can be explained by the fact that the Buk missile launcher that shot down MH17 belonged to ... the 53rd Anti-Aircraft Missile Brigade.",
          "context": "Weapon system implicated in downing MH17 and a key investigative topic tied to GRU interest in deflection."
        }
      ]
    },
    {
      "entity_id": "E52",
      "canonical_name": "Russia's Military Intelligence Academy",
      "entity_type": "organization",
      "aliases": [
        "Military Intelligence Academy",
        "Russia's Military Intelligence Academy"
      ],
      "mentions": [
        {
          "snippet": "Col. Sergey Chebanov – a graduate of Russia's Military Intelligence Academy with a roster of international diplomatic postings under his belt –",
          "context": "Institution where Chebanov was educated, establishing his official GRU credentials."
        }
      ]
    },
    {
      "entity_id": "E53",
      "canonical_name": "Donetsk People's Republic Ministry of Information",
      "entity_type": "organization",
      "aliases": [
        "DNR's Ministry of Information",
        "Donetsk People's Republic's Ministry of Information"
      ],
      "mentions": [
        {
          "snippet": "a leak appeared online from Tatyana Egorova, a staff member of the so-called Donetsk People's Republic's (DNR's) Ministry of Information.",
          "context": "Office from which the 'Egorova Leaks' originated, containing correspondence with Van der Werff."
        }
      ]
    },
    {
      "entity_id": "E54",
      "canonical_name": "Egorova Leaks",
      "entity_type": "event",
      "aliases": [
        "the Egorova Leaks",
        "Egorova leak"
      ],
      "mentions": [
        {
          "snippet": "The Egorova Leaks include the entire inbox of the DNR official's Mail.ru account, through which she conducted official 'government' business.",
          "context": "Leak of Tatyana Egorova's emails that documented correspondence with Max van der Werff and pro-separatist messaging efforts."
        }
      ]
    },
    {
      "entity_id": "E55",
      "canonical_name": "#BonanzaLeaks",
      "entity_type": "event",
      "aliases": [
        "BonanzaLeaks",
        "#BonanzaLeaks"
      ],
      "mentions": [
        {
          "snippet": "Just ten days after the Bonanza Media team returned from eastern Ukraine, the calls from their GRU contacts again started pouring in ... the Bonanza Media twitter account, using the hashtag #BonanzaLeaks, published its first 'leaked' internal JIT document",
          "context": "Hashtag/campaign used by Bonanza to publish purported 'leaks' from JIT internal documents derived from a hack."
        }
      ]
    },
    {
      "entity_id": "E56",
      "canonical_name": "MH17 downing",
      "entity_type": "event",
      "aliases": [
        "MH17",
        "downing of flight MH17",
        "the downing of MH17"
      ],
      "mentions": [
        {
          "snippet": "the downing of flight MH17 in 2014.",
          "context": "Central international incident under investigation; the focus of Bonanza's narratives and the GRU disinformation campaign."
        },
        {
          "snippet": "Bonanza Media, a special-purpose media project dedicated to publicizing alternative narratives about the causes of the crash of MH17",
          "context": "Bonanza's core subject matter; used to challenge JIT findings."
        }
      ]
    },
    {
      "entity_id": "E57",
      "canonical_name": "Russian state media",
      "entity_type": "organization",
      "aliases": [
        "Russian state media",
        "Russian state outlets"
      ],
      "mentions": [
        {
          "snippet": "However, Russian state media and Kremlin officials made full use of out-of-context quotes from the leaks",
          "context": "Describes how state-controlled media amplified Bonanza's selective presentation of leaked documents."
        }
      ]
    },
    {
      "entity_id": "E58",
      "canonical_name": "Dutch donors",
      "entity_type": "organization",
      "aliases": [
        "Dutch donors"
      ],
      "mentions": [
        {
          "snippet": "The project raised just over $23,000 in 18 days from 67 anonymous donors, with most of the funding coming – according to Van der Werff and Yerlashova – from Dutch donors.",
          "context": "Describes claimed geographic origin of crowdfunding support for Bonanza; treated as a named donor group in the text."
        }
      ]
    },
    {
      "entity_id": "E59",
      "canonical_name": "Hague (public screening) 23 October 2019",
      "entity_type": "event",
      "aliases": [
        "public screening in the Hague",
        "Hague screening 23 October 2019"
      ],
      "mentions": [
        {
          "snippet": "contained images and texts from an invitation to a public screening of Bonanza's documentary in the Hague, scheduled for 23 October 2019.",
          "context": "Specific event organized by Bonanza to screen their documentary; referenced in GRU mailbox attachments."
        }
      ]
    },
    {
      "entity_id": "E60",
      "canonical_name": "Hack of JIT documents (Malaysia office)",
      "entity_type": "event",
      "aliases": [
        "hack of JIT member country's office",
        "hack of Malaysian JIT office"
      ],
      "mentions": [
        {
          "snippet": "an analysis ... shows they were likely to be obtained from a hack of one of the JIT member countries' offices, Malaysia.",
          "context": "Describes the likely origin of the internal JIT documents leaked by Bonanza, attributed to a hack of Malaysia's JIT office."
        }
      ]
    }
  ],
  "metadata": {
    "report_id": "report2_bellingcat_gru_disinformation",
    "total_entities_extracted": 60,
    "extraction_timestamp": "2025-11-17T11:56:07.695999+00:00"
  }
}